# IsValidRigidLinksOption Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..IsValidRigidLinksOption Method
AnalyticalModel Class See Also
---
Indicates if Rigid Links option is valid for the Analytical Model.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsValidRigidLinksOption(
	AnalyticalRigidLinksOption rigidLinksOption
)
```

Visual Basic
---
```text
Public Function IsValidRigidLinksOption ( _
	rigidLinksOption As AnalyticalRigidLinksOption _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidRigidLinksOption(
	AnalyticalRigidLinksOption rigidLinksOption
)
```

# ### Parameters
rigidLinksOption
    Type: Autodesk.Revit.DB.Structure..::..AnalyticalRigidLinksOption Rigid Links option to validate.
# ### Return Value
True if option is valid, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace